/*=============================================================================================================*/
/*!
    \brief Класс для работы с анализатором спектра R&S FSL
    \version 1.0
    \warning Данный класс создан только в учебных целях

    Для соединения и разъединения с прибором использовать функции базового класса:
    ConnectDevice и DisconnectDevice.

    Все методы возвращают строку. Если ошибок нет - нулевую строку.
*/
/*=============================================================================================================*/

#ifndef FSL_H
#define FSL_H

#include <basedevice.h>

class FSL: public BaseDevice
{
public:

    FSL();
    ~FSL();

/*=============================================================================================================*/
/*!  \brief
Установка центральной частоты
\param [in] Freq - Центральная частота
\param [in] prefix - Приставки к частоте (GHz, MHz, KHz,Hz)
\return Строку QString. Ежели строка пустая- Успешное выполнение команды, нет- читаем.
*/
/*=============================================================================================================*/
 QString CenterFreq(QString Freq, QString prefix);

/*=============================================================================================================*/
/*!  \brief
Установка шага центральной частоты
\param [in] Step - шаг центральной частоты
\param [in] prefix - Приставки к частоте (GHz, MHz, KHz,Hz)
\return Строку QString. Ежели строка пустая- Успешное выполнение команды, нет- читаем.
*/
/*=============================================================================================================*/
QString StepCentralFreq(QString Step, QString prefix);

/*=============================================================================================================*/
/*!  \brief
Установка Спана
\param [in] Span -
\param [in] prefix - Приставки к частоте (GHz, MHz, KHz,Hz)
\return Строку QString. Ежели строка пустая- Успешное выполнение команды, нет- читаем.
*/
/*=============================================================================================================*/
QString FreqSpan(QString Span, QString prefix);

/*=============================================================================================================*/
/*!  \brief
Свипирование
\param [in] StartStop - true (свипирование разрешено); false (стоп свипирования)
\return Строку QString. Ежели строка пустая- Успешное выполнение команды, нет- читаем.
*/
/*=============================================================================================================*/
QString SingleSweep(bool StartStop);

/*=============================================================================================================*/
/*!  \brief
Установка шага центральной частоты
\param [in] StartStop - true (свипирование разрешено); false (стоп свипирования)
\return Строку QString. Ежели строка пустая- Успешное выполнение команды, нет- читаем.
*/
/*=============================================================================================================*/
QString TRACeData();


};

#endif // FSL_H
