/*=============================================================================================================*/
/*!
    \brief Класс для работы с анализатором спектра R&S FSL
    \version 1.0
    \warning

    Для соединения и разъединения с прибором использовать функции базового класса:
    ConnectDevice и DisconnectDevice.

    Все методы возвращают строку. Если ошибок нет - нулевую строку.
*/
/*=============================================================================================================*/

#ifndef FSL_H
#define FSL_H

#include <basedevice.h>

class FSL: public BaseDevice
{
public:

  FSL();
  ~FSL();

  enum typeFreq{
    GHz,
    MHz,
    KHz,
    Hz
  }freq;
/*=====================================================================================*/
/*!  \brief
Установка центральной частоты
\param [in] Freq - Центральная частота
\param [in] prefix - Приставки к частоте (GHz, MHz, KHz,Hz)
\return Строку QString. Ежели строка пустая- Успешное выполнение команды, нет- читаем.
*/

QString centerFreq(const double freq, typeFreq prefix);

/*=====================================================================================*/
/*!  \brief
Установка шага центральной частоты
\param [in] Step - шаг центральной частоты
\param [in] prefix - Приставки к частоте (GHz, MHz, KHz,Hz)
\return Строку QString. Ежели строка пустая- Успешное выполнение команды, нет- читаем.
*/

QString stepCentralFreq(const double step, typeFreq prefix);

/*=====================================================================================*/
/*!  \brief
Установка Спана
\param [in] Span -
\param [in] prefix - Приставки к частоте (GHz, MHz, KHz,Hz)
\return Строку QString. Ежели строка пустая- Успешное выполнение команды, нет- читаем.
*/

QString freqSpan(const double span, typeFreq prefix);

/*=====================================================================================*/
/*!  \brief
Свипирование
\param [in] StartStop - true (свипирование разрешено); false (стоп свипирования)
\return Строку QString. Ежели строка пустая- Успешное выполнение команды, нет- читаем.
*/

QString singleSweep(bool StartStop);

/*=====================================================================================*/
/*!  \brief
Установка шага центральной частоты
\param [in] number -  количество символов для чтения
\return Строку QString. Ежели строка пустая- Успешное выполнение команды, нет- читаем.
*/

QString traceData(uint number);

/*=====================================================================================*/
/*!  \brief
 Включение или отключение дисплея в remote control mode
\param [in] param  - true дисплей включен. false- дисплей отключен.
*/

void display(bool param);
/*=====================================================================================*/
/*!  \brief
 Смена RBW от 2 - 5 KHz
\param [in] freq  - Частота сканирования в Hz
*/

void rbw(uint freq);
/*=====================================================================================*/
/*!  \brief
Функцию использовать после успешного соединения с прибором
*/

void init();
/*=====================================================================================*/
/*!  \brief
Калибровка fsl
*/
void calibrate(bool clearSet, const double freq);

/*=====================================================================================*/
};

#endif // FSL_H
